In [1]:
import pandas as pd
fortune=pd.read_csv('fortune1000.csv',index_col='Rank')
fortune.head()

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000
4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",210821,24083,331000
5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400

In [2]:
max_revenue=fortune['Revenue'].max()
min_revenu=fortune['Revenue'].min()

In [3]:
# All Technology companies located in Seattle
filt1=(fortune['Sector']=='Technology') & (fortune['Location']=='Seattle, WA')

In [4]:
fortune[filt1]

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
18,Amazon.com,Technology,Internet Services and Retailing,"Seattle, WA",107006,596,230800
990,F5 Networks,Technology,Network and Other Communications Equipment,"Seattle, WA",1920,365,4178

In [5]:
# Details of Microsoft
filt2=fortune['Company']=='Microsoft'
fortune[filt2]

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
25,Microsoft,Technology,Computer Software,"Redmond, WA",93580,12193,118000

In [6]:
fortune.head()

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000
4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",210821,24083,331000
5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400

In [7]:
#  Group by sector

In [8]:
sector=fortune.groupby('Sector')
print(sector)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001CB52624208>

In [9]:
rev_sector=fortune.groupby('Sector')['Revenue']
for name,rev in rev_sector:
    print(name)
    print(rev)

Aerospace & Defense
Rank
24     96114
45     61047
60     46132
88     31469
118    23526
120    23247
209    13423
245    11554
282    10056
378     7020
389     6644
490     5262
560     4369
605     3889
785     2730
788     2707
836     2526
903     2264
958     2038
987     1923
Name: Revenue, dtype: int64
Apparel
Rank
91     30601
231    12377
340     8020
354     7620
448     5732
547     4495
575     4192
597     3963
683     3229
695     3159
726     3014
794     2692
877     2344
882     2326
917     2204
Name: Revenue, dtype: int64
Business Services
Rank
144    19330
186    15134
199    14329
204    13880
221    12961
248    11477
249    11451
294     9667
307     9248
312     9115
355     7614
392     6595
404     6440
440     5817
467     5518
468     5484
481     5313
485     5291
492     5254
503     5095
545     4508
626     3645
635     3574
652     3485
677     3275
694     3160
714     3066
729     3008
734     2986
735     2986
737     2984
744     2951
767     2825
776     2780
777     2774
783     2740
791     2696
792     2694
796     2682
801     2664
803     2659
816     2604
819     2594
820     2591
869     2383
870     2382
886     2314
939     2117
951     2077
952     2068
993     1910
Name: Revenue, dtype: int64
Chemicals
Rank
56     48778
101    27940
182    15330
189    15001
206    13545
253    11339
262    10776
277    10299
288     9895
296     9648
316     8895
538     4595
549     4463
555     4393
566     4308
580     4140
613     3787
624     3651
654     3471
668     3378
717     3052
720     3023
724     3017
758     2871
761     2854
829     2542
865     2392
898     2289
934     2141
949     2084
Name: Revenue, dtype: int64
Energy
Rank
2      246204
14     131118
30      87169
32      81824
42      64566
        ...
981      1958
983      1944
995      1908
997      1898
997      1898
Name: Revenue, Length: 122, dtype: int64
Engineering & Construction
Rank
155    18114
156    17990
235    12115
260    10824
301     9474
314     8992
352     7632
381     6723
433     5982
478     5362
498     5170
501     5096
516     4921
572     4208
576     4171
640     3540
719     3032
738     2977
822     2580
863     2401
874     2371
892     2299
929     2149
963     2022
985     1929
994     1909
Name: Revenue, dtype: int64
Financials
Rank
4      210821
16     110359
23     101006
26      93056
27      90033
        ...
938      2123
959      2034
976      1989
988      1922
996      1902
Name: Revenue, Length: 139, dtype: int64
Food and Drug Stores
Rank
7      153290
17     109830
19     103444
87      32619
107     26528
160     17820
181     15389
595      3971
614      3779
631      3593
669      3367
756      2877
809      2639
849      2472
928      2151
Name: Revenue, dtype: int64
Food, Beverages & Tobacco
Rank
41     67702
44     63056
62     44294
66     41373
84     34582
94     29636
106    26794
149    18854
153    18338
161    17630
176    15849
207    13525
215    13161
242    11684
266    10675
304     9264
336     8122
337     8082
362     7387
397     6540
413     6282
429     6028
452     5693
456     5621
460     5594
535     4648
542     4520
567     4296
574     4199
587     4071
608     3866
615     3779
636     3568
664     3397
686     3206
702     3134
770     2804
787     2723
795     2689
804     2656
889     2307
902     2272
954     2066
Name: Revenue, dtype: int64
Health Care
Rank
5      181241
6      157107
12     135962
21     102531
22     101752
        ...
935      2134
960      2029
965      2019
977      1988
978      1987
Name: Revenue, Length: 75, dtype: int64
Hotels, Resturants & Leisure
Rank
109    25413
146    19163
195    14486
218    13105
241    11689
254    11272
309     9190
371     7164
444     5763
466     5536
534     4654
546     4501
557     4378
562     4328
585     4076
731     3002
763     2842
764     2838
779     2759
797     2682
895     2292
915     2217
918     2199
941     2101
999     1896
Name: Revenue, dtype: int64
Household Products
Rank
34     78756
151    18591
174    16034
256    11211
261    10780
328     8604
338     8072
345     7904
370     7173
434     5972
441     5816
450     5703
455     5666
533     4658
550     4448
554     4395
601     3937
665     3395
699     3151
716     3060
856     2421
890     2304
900     2284
907     2247
932     2142
950     2083
967     2016
992     1914
Name: Revenue, dtype: int64
Industrials
Rank
11      140389
59       47011
75       38581
93       30274
97       28863
128      22304
134      20891
148      19110
211      13405
224      12712
360       7467
377       7029
396       6543
412       6308
419       6155
539       4561
544       4515
596       3967
622       3653
623       3652
630       3593
645       3510
655       3467
658       3436
666       3390
674       3308
690       3172
757       2872
782       2741
789       2707
806       2647
813       2619
823       2578
831       2537
832       2536
835       2526
841       2506
847       2486
866       2391
867       2389
873       2371
887       2309
942       2100
947       2084
964       2021
1000      1895
Name: Revenue, dtype: int64
Materials
Rank
126    22534
127    22365
170    16439
244    11574
251    11381
303     9351
321     8762
341     7997
356     7594
373     7082
375     7032
383     6693
417     6162
418     6156
426     6070
435     5967
446     5742
480     5350
489     5264
514     4964
518     4881
577     4160
586     4071
616     3776
617     3764
620     3720
625     3645
628     3617
637     3564
639     3543
641     3540
660     3422
667     3384
687     3206
691     3167
751     2887
774     2789
793     2692
857     2420
885     2317
911     2227
982     1950
986     1924
Name: Revenue, dtype: int64
Media
Rank
53     52465
96     28987
99     28118
203    13886
213    13268
255    11257
327     8633
366     7246
406     6394
414     6242
525     4795
530     4678
681     3242
705     3127
707     3103
722     3018
741     2966
752     2885
759     2858
762     2853
821     2581
913     2219
968     2011
969     2011
989     1921
Name: Revenue, dtype: int64
Motor Vehicles & Parts
Rank
8      152356
9      149558
70      40204
147     19115
154     18211
169     16443
281     10140
310      9170
334      8209
339      8023
424      6098
428      6060
470      5444
588      4046
591      4007
604      3903
647      3506
670      3343
718      3047
739      2973
811      2628
957      2042
961      2028
979      1986
Name: Revenue, dtype: int64
Retailing
Rank
1      482130
15     116199
28      88519
38      73785
47      59074
        ...
899      2288
922      2195
937      2129
940      2109
973      1999
Name: Revenue, Length: 80, dtype: int64
Technology
Rank
3      233715
18     107006
20     103355
25      93580
31      82461
        ...
970      2001
971      2001
975      1991
984      1931
990      1920
Name: Revenue, Length: 102, dtype: int64
Telecommunications
Rank
10     146801
13     131620
37      74510
116     23697
159     17900
187     15069
292      9754
333      8229
399      6510
443      5765
461      5576
496      5176
526      4772
619      3729
786      2726
Name: Revenue, dtype: int64
Transportation
Rank
48     58363
58     47453
67     40990
68     40704
80     37864
129    21813
142    19820
208    13476
239    11811
270    10511
353     7623
390     6617
395     6572
405     6416
407     6393
416     6188
432     5995
459     5598
521     4832
528     4719
570     4229
578     4143
642     3526
672     3321
709     3096
713     3075
740     2972
800     2667
814     2605
858     2419
884     2318
930     2148
933     2142
945     2094
972     2000
974     1995
Name: Revenue, dtype: int64
Wholesalers
Rank
57     48681
64     43026
92     30380
102    27925
108    26380
119    23282
122    23128
167    16802
183    15280
185    15270
212    13338
276    10315
285     9973
315     8982
317     8858
320     8779
323     8718
335     8185
351     7652
357     7519
369     7193
391     6596
423     6110
463     5565
474     5373
477     5363
484     5305
564     4319
581     4113
599     3949
627     3633
653     3482
685     3219
727     3010
747     2910
780     2752
808     2640
837     2515
875     2363
991     1917
Name: Revenue, dtype: int64

In [10]:
max_rev_sector=fortune.groupby('Sector')['Revenue'].max()

In [11]:
max_rev_sector

Sector
Aerospace & Defense              96114
Apparel                          30601
Business Services                19330
Chemicals                        48778
Energy                          246204
Engineering & Construction       18114
Financials                      210821
Food and Drug Stores            153290
Food, Beverages & Tobacco        67702
Health Care                     181241
Hotels, Resturants & Leisure     25413
Household Products               78756
Industrials                     140389
Materials                        22534
Media                            52465
Motor Vehicles & Parts          152356
Retailing                       482130
Technology                      233715
Telecommunications              146801
Transportation                   58363
Wholesalers                      48681
Name: Revenue, dtype: int64

In [12]:
for name,rev in rev_sector:
    if name=='Media':
        print(rev)

Rank
53     52465
96     28987
99     28118
203    13886
213    13268
255    11257
327     8633
366     7246
406     6394
414     6242
525     4795
530     4678
681     3242
705     3127
707     3103
722     3018
741     2966
752     2885
759     2858
762     2853
821     2581
913     2219
968     2011
969     2011
989     1921
Name: Revenue, dtype: int64

In [13]:
min_rev_sector=fortune.groupby('Sector')['Revenue'].min()
min_rev_sector

Sector
Aerospace & Defense             1923
Apparel                         2204
Business Services               1910
Chemicals                       2084
Energy                          1898
Engineering & Construction      1909
Financials                      1902
Food and Drug Stores            2151
Food, Beverages & Tobacco       2066
Health Care                     1987
Hotels, Resturants & Leisure    1896
Household Products              1914
Industrials                     1895
Materials                       1924
Media                           1921
Motor Vehicles & Parts          1986
Retailing                       1999
Technology                      1920
Telecommunications              2726
Transportation                  1995
Wholesalers                     1917
Name: Revenue, dtype: int64

In [14]:
# Give maximum and minimum number of employees in each sector

In [15]:
max_employee_sector=fortune.groupby('Sector')['Employees'].max()
max_employee_sector.sort_values(ascending=False).head()

Sector
Retailing                       2300000
Hotels, Resturants & Leisure     505000
Food and Drug Stores             431000
Technology                       411798
Transportation                   341240
Name: Employees, dtype: int64

In [16]:
min_employee_sector=fortune.groupby('Sector')['Employees'].min()
min_employee_sector.sort_values().head(5)

Sector
Materials                       52
Financials                     187
Energy                         480
Wholesalers                    500
Engineering & Construction    1036
Name: Employees, dtype: int64

In [17]:
fortune.head()

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000
4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",210821,24083,331000
5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400

In [18]:
mask1=fortune['Industry'].str.contains('Health')
filt1=fortune[mask1]

In [19]:
filt1

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400
6,UnitedHealth Group,Health Care,Health Care: Insurance and Managed Care,"Minnetonka, MN",157107,5813,200000
12,AmerisourceBergen,Health Care,Wholesalers: Health Care,"Chesterbrook, PA",135962,-135,17000
21,Cardinal Health,Health Care,Wholesalers: Health Care,"Dublin, OH",102531,1215,34500
22,Express Scripts Holding,Health Care,Health Care: Pharmacy and Other Services,"St. Louis, MO",101752,2476,25900
...,...,...,...,...,...,...,...
925,Knights of Columbus,Financials,"Insurance: Life, Health (Mutual)","New Haven, CT",2180,68,929
926,Symetra Financial,Financials,"Insurance: Life, Health (stock)","Bellevue, WA",2179,147,1400
935,VCA,Health Care,Health Care: Medical Facilities,"Los Angeles, CA",2134,211,12700
960,PharMerica,Health Care,Health Care: Pharmacy and Other Services,"Louisville, KY",2029,35,5200
978,Providence Service,Health Care,Health Care: Pharmacy and Other Services,"Tucson, AZ",1987,84,9072

In [28]:
mask2=fortune['Industry'].str.match('Wholesalers: Health Care')
filt2=fortune[mask2]
filt2

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400
12,AmerisourceBergen,Health Care,Wholesalers: Health Care,"Chesterbrook, PA",135962,-135,17000
21,Cardinal Health,Health Care,Wholesalers: Health Care,"Dublin, OH",102531,1215,34500
268,Henry Schein,Health Care,Wholesalers: Health Care,"Melville, NY",10630,479,19000
291,Owens & Minor,Health Care,Wholesalers: Health Care,"Mechanicsville, VA",9773,103,8100
559,Patterson,Health Care,Wholesalers: Health Care,"St. Paul, MN",4375,223,7000

In [37]:
mask3=fortune['Industry'].str.match('Wholesalers: Health Care') 
mask4=fortune['Revenue']>100000
filt4=fortune[mask3 & mask4]
filt4

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400
12,AmerisourceBergen,Health Care,Wholesalers: Health Care,"Chesterbrook, PA",135962,-135,17000
21,Cardinal Health,Health Care,Wholesalers: Health Care,"Dublin, OH",102531,1215,34500

In [40]:
mask5=fortune['Industry'].str.match('Wholesalers: Health Care')
filt5=fortune[mask2]
filt5[['Industry','Revenue','Employees']]

                      Industry  Revenue  Employees
Rank
5     Wholesalers: Health Care   181241      70400
12    Wholesalers: Health Care   135962      17000
21    Wholesalers: Health Care   102531      34500
268   Wholesalers: Health Care    10630      19000
291   Wholesalers: Health Care     9773       8100
559   Wholesalers: Health Care     4375       7000

In [50]:
fortune.iloc[[11]]

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
12,AmerisourceBergen,Health Care,Wholesalers: Health Care,"Chesterbrook, PA",135962,-135,17000

In [51]:
# Walmart Dataset

In [55]:
import pandas as pd
sales=pd.read_csv('sales.csv')
sales.head()

,Unnamed: 0,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

In [90]:
sales.sort_values('date')

,Unnamed: 0,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
6437,6437,19,A,13,2010-02-05,38597.52,False,-6.133333,0.780365,8.350
1249,1249,2,A,31,2010-02-05,3840.21,False,4.550000,0.679451,8.324
6449,6449,19,A,14,2010-02-05,17590.59,False,-6.133333,0.780365,8.350
6461,6461,19,A,16,2010-02-05,4929.87,False,-6.133333,0.780365,8.350
...,...,...,...,...,...,...,...,...,...,...
3592,3592,6,A,99,2012-10-05,440.00,False,21.577778,0.955511,5.329
8108,8108,20,A,99,2012-10-05,660.00,False,15.983333,1.052726,7.293
10773,10773,39,A,99,2012-10-05,915.00,False,22.250000,0.955511,6.228
6257,6257,14,A,96,2012-10-12,3.00,False,12.483333,1.056689,8.667
3384,3384,6,A,77,2012-10-26,-21.63,False,22.411111,0.926188,5.329

In [56]:
sales.columns

Index(['Unnamed: 0', 'store', 'type', 'department', 'date', 'weekly_sales',
       'is_holiday', 'temperature_c', 'fuel_price_usd_per_l', 'unemployment'],
      dtype='object')

In [57]:
sales.index

RangeIndex(start=0, stop=10774, step=1)

In [73]:
# Date range sales

In [91]:
mask1=(sales['date'] >='2010-02-05') & (sales['date']<='2010-02-06')

In [92]:
filt1=sales[mask1]
filt1

,Unnamed: 0,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
12,12,1,A,2,2010-02-05,50605.27,False,5.727778,0.679451,8.106
24,24,1,A,3,2010-02-05,13740.12,False,5.727778,0.679451,8.106
36,36,1,A,4,2010-02-05,39954.04,False,5.727778,0.679451,8.106
48,48,1,A,5,2010-02-05,32229.38,False,5.727778,0.679451,8.106
...,...,...,...,...,...,...,...,...,...,...
10703,10703,39,A,94,2010-02-05,50121.73,False,6.833333,0.679451,8.554
10715,10715,39,A,95,2010-02-05,88385.24,False,6.833333,0.679451,8.554
10727,10727,39,A,96,2010-02-05,21450.05,False,6.833333,0.679451,8.554
10739,10739,39,A,97,2010-02-05,21162.05,False,6.833333,0.679451,8.554
10751,10751,39,A,98,2010-02-05,9023.09,False,6.833333,0.679451,8.554

In [93]:
# sales filtering

In [101]:
mask20=(sales['type']=='B') & (sales['weekly_sales']>200000)
filt20=sales[mask20]
filt20

,Unnamed: 0,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
4271,4271,10,B,72,2010-02-05,232558.51,False,12.411111,0.782478,9.765
4281,4281,10,B,72,2010-12-03,218559.54,False,10.650000,0.803348,9.003

In [102]:
mask21=(sales['type']=='A') & (sales['weekly_sales']>200000)
filt21=sales[mask21]
filt21

,Unnamed: 0,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
6201,6201,14,A,92,2010-02-05,293966.05,False,-2.605556,0.735455,8.992
6202,6202,14,A,92,2010-03-05,214383.07,False,2.850000,0.733606,8.992
6203,6203,14,A,92,2010-04-02,203457.42,False,8.744444,0.752891,8.899
6204,6204,14,A,92,2010-05-07,206160.36,False,21.527778,0.783535,8.899
6207,6207,14,A,92,2010-08-06,204695.13,False,25.094444,0.735455,8.743
6210,6210,14,A,92,2010-11-05,206935.29,False,7.583333,0.770590,8.724
6237,6237,14,A,95,2010-02-05,213042.66,False,-2.605556,0.735455,8.992

In [107]:
mask22=sales['temperature_c']<0
filt22=sales.loc[mask22,['weekly_sales','temperature_c']]
filt22

      weekly_sales  temperature_c
2315        498.00      -1.755556
2492          1.00      -1.755556
4495      46761.90      -0.261111
4505      47101.26      -3.444444
4506      24627.06      -8.366667
...            ...            ...
8938      74898.99      -2.672222
8950     133147.07      -2.672222
8962      17209.14      -2.672222
8974      25806.87      -2.672222
8986      13579.67      -2.672222

[750 rows x 2 columns]

In [110]:
mask23=sales['temperature_c']>20
filt23=sales.loc[mask23,['weekly_sales','temperature_c']]
filt23

       weekly_sales  temperature_c
3          17413.94      22.527778
4          17558.09      27.050000
5          16333.14      27.172222
6          17508.41      30.644444
7          16241.78      27.338889
...             ...            ...
10766         40.00      20.416667
10767        622.00      31.072222
10771        450.00      27.288889
10772          0.06      25.644444
10773        915.00      22.250000

[4671 rows x 2 columns]